temporal-community/badge.temporal.io/firmware/lib/micropython_embed/src/ports/esp32/network_wlan.c
static void network_wlan_ip_event_handler(void *event_handler_arg, esp_event_base_t event_base, int32_t event_id, void *event_data) {
    switch (event_id) {
        case IP_EVENT_STA_GOT_IP:
            ESP_LOGI("network", "GOT_IP");
            wifi_sta_connected = true;
            wifi_sta_disconn_reason = 0; // Success so clear error. (in case of new error will be replaced anyway)
            #if MICROPY_HW_ENABLE_MDNS_QUERIES || MICROPY_HW_ENABLE_MDNS_RESPONDER
            if (!mdns_initialised) {
                mdns_init();
                #if MICROPY_HW_ENABLE_MDNS_RESPONDER
                mdns_hostname_set(mod_network_hostname_data);
                mdns_instance_name_set(mod_network_hostname_data);
                #endif
                mdns_initialised = true;
            }
            #endif
            break;

        default:
            break;
    }
}

static void require_if(mp_obj_t wlan_if, int if_no) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(wlan_if);
    if (self->if_id != if_no) {
        mp_raise_msg(&mp_type_OSError, if_no == ESP_IF_WIFI_STA ? MP_ERROR_TEXT("STA required") : MP_ERROR_TEXT("AP required"));
    }
}

// Replay: bridges into the Arduino C-layer WiFiService (firmware/src/api).
// On this badge the C-layer owns esp_wifi init + the default netifs, so
// network.WLAN delegates association to it rather than driving esp_wifi.
extern int replay_wifi_sta_connect(const char *ssid, const char *password);
extern void replay_wifi_sta_disconnect(void);

void esp_initialise_wifi(void) {
    static int wifi_initialized = 0;
    if (!wifi_initialized) {
        esp_exceptions(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, network_wlan_wifi_event_handler, NULL, NULL));
        esp_exceptions(esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, network_wlan_ip_event_handler, NULL, NULL));

        wlan_sta_obj.base.type = &esp_network_wlan_type;
        wlan_sta_obj.if_id = ESP_IF_WIFI_STA;
        // Replay: never create the default STA netif. The Arduino C-layer
        // (WiFiGeneric wifiLowLevelInit) unconditionally creates BOTH the
        // STA and AP default netifs whenever WiFi comes up and tracks them
        // in its own private table; if MicroPython also creates one, the
        // C-layer's later create hits the duplicate-if_key assert in
        // esp_netif and panics the whole badge. Reuse the C-layer's netif
        // (may be NULL until WiFi is up; the WIFI_EVENT handlers below
        // refresh it on every start so the cached pointer never dangles).
        wlan_sta_obj.netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        wlan_sta_obj.active = false;

        wlan_ap_obj.base.type = &esp_network_wlan_type;
        wlan_ap_obj.if_id = ESP_IF_WIFI_AP;
        // Replay: reuse-only (see STA note above); never create the AP
        // netif — the C-layer creates it and a duplicate key panics.
        wlan_ap_obj.netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
        wlan_ap_obj.active = false;

        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        #if CONFIG_SPIRAM_IGNORE_NOTFOUND
        if (!esp_psram_is_initialized()) {
            // If PSRAM failed to initialize, disable "Wi-Fi Cache TX Buffers"
            // (default SPIRAM config ESP32_WIFI_CACHE_TX_BUFFER_NUM==32, this is 54,400 bytes of heap)
            cfg.cache_tx_buf_num = 0;
            cfg.feature_caps &= ~CONFIG_FEATURE_CACHE_TX_BUF_BIT;

            // Set some other options back to the non-SPIRAM default values
            // to save more RAM.
            //
            // These can be determined from ESP-IDF components/esp_wifi/Kconfig and the
            // WIFI_INIT_CONFIG_DEFAULT macro
            cfg.tx_buf_type = 1; // Dynamic, this "magic number" is defined in IDF KConfig
            cfg.static_tx_buf_num = 0; // Probably don't need, due to tx_buf_type
            cfg.dynamic_tx_buf_num = 32; // ESP-IDF default value (maximum)
        }
        #endif
        ESP_LOGD("modnetwork", "Initializing WiFi");
        // Replay: do NOT initialise esp_wifi here. The Arduino C-layer
        // (WiFiGeneric wifiLowLevelInit / WiFiService) is the sole owner of
        // esp_wifi_init + the default netifs. If MicroPython calls
        // esp_wifi_init first, the C-layer's later init returns
        // ESP_ERR_WIFI_INIT_STATE, WiFi.mode() bails before creating netifs,
        // and connect() fails. network.WLAN delegates ALL radio control to
        // WiFiService (see network_wlan_connect / network_wlan_active).
        (void)cfg;

        // Replay: if a Wi-Fi mode is already set the C-layer is running
        // (boot auto-connect), so sync the module statics for
        // active()/status()/isconnected().
        wifi_mode_t replay_wifi_mode = WIFI_MODE_NULL;
        if (esp_wifi_get_mode(&replay_wifi_mode) == ESP_OK && replay_wifi_mode != WIFI_MODE_NULL) {
            wifi_started = true;
            if (replay_wifi_mode & WIFI_MODE_STA) {
                wlan_sta_obj.active = true;
            }
            if (replay_wifi_mode & WIFI_MODE_AP) {
                wlan_ap_obj.active = true;
            }
            wifi_ap_record_t replay_ap_info;
            if (esp_wifi_sta_get_ap_info(&replay_ap_info) == ESP_OK) {
                wifi_sta_connected = true;
            }
        }

        ESP_LOGD("modnetwork", "Initialized");
        wifi_initialized = 1;
    }
}

static mp_obj_t network_wlan_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    esp_initialise_wifi();

    int idx = (n_args > 0) ? mp_obj_get_int(args[0]) : ESP_IF_WIFI_STA;
    if (idx == ESP_IF_WIFI_STA) {
        return MP_OBJ_FROM_PTR(&wlan_sta_obj);
    } else if (idx == ESP_IF_WIFI_AP) {
        return MP_OBJ_FROM_PTR(&wlan_ap_obj);
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid WLAN interface identifier"));
    }
}

static mp_obj_t network_wlan_active(size_t n_args, const mp_obj_t *args) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (n_args > 1) {
        bool active = mp_obj_is_true(args[1]);
        // Replay: never poke esp_wifi here — the Arduino C-layer
        // (WiFiService) owns radio bring-up. active(True) only records
        // intent; the association happens in connect(), which routes
        // through WiFiService. active(False) tears the STA link down.
        // Not touching esp_wifi means we can't double-init the shared
        // driver or fight the C-layer's WiFi.mode() cycling.
        if (!active && self->if_id == ESP_IF_WIFI_STA) {
            replay_wifi_sta_disconnect();
        }
        self->active = active;
    }

    // self->active is kept current by the WIFI_EVENT STA/AP start/stop
    // handlers, so it reflects the C-layer's real radio state without us
    // querying esp_wifi (which would raise if the C-layer has since
    // deinitialised the driver).
    return self->active ? mp_const_true : mp_const_false;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_wlan_active_obj, 1, 2, network_wlan_active);

static mp_obj_t network_wlan_connect(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_ssid, ARG_key, ARG_bssid };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_, MP_ARG_OBJ, {.u_obj = mp_const_none} },
        { MP_QSTR_, MP_ARG_OBJ, {.u_obj = mp_const_none} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Replay: route association through the Arduino C-layer (WiFiService);
    // it is the sole owner of esp_wifi init + netifs on this badge, so
    // esp_wifi_set_config/esp_wifi_connect from here would fight it. We
    // forward only the SSID/key (BSSID pinning is not supported via the
    // C-layer path) and deliberately do NOT set wifi_sta_connect_requested,
    // so MicroPython's STA_DISCONNECTED auto-reconnect stays off and does
    // not race the C-layer.
    char replay_ssid[33] = {0};
    char replay_key[64] = {0};
    if (n_args > 1) {
        size_t len;
        const char *p;
        if (args[ARG_ssid].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_ssid].u_obj, &len);
            memcpy(replay_ssid, p, MIN(len, sizeof(replay_ssid) - 1));
        }
        if (args[ARG_key].u_obj != mp_const_none) {
            p = mp_obj_str_get_data(args[ARG_key].u_obj, &len);
            memcpy(replay_key, p, MIN(len, sizeof(replay_key) - 1));
        }
    }
    if (replay_ssid[0] == 0) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("connect requires an SSID"));
    }

    MP_THREAD_GIL_EXIT();
    replay_wifi_sta_connect(replay_ssid, replay_key);
    MP_THREAD_GIL_ENTER();

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_wlan_connect_obj, 1, network_wlan_connect);

static mp_obj_t network_wlan_disconnect(mp_obj_t self_in) {
    wifi_sta_connect_requested = false;
    // Replay: tear down via the C-layer (WiFiService) which owns the radio.
    replay_wifi_sta_disconnect();
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_wlan_disconnect_obj, network_wlan_disconnect);

static mp_obj_t network_wlan_status(size_t n_args, const mp_obj_t *args) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (n_args == 1) {
        if (self->if_id == ESP_IF_WIFI_STA) {
            // Case of no arg is only for the STA interface
            if (wifi_sta_connected) {
                // Happy path, connected with IP
                return MP_OBJ_NEW_SMALL_INT(STAT_GOT_IP);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND_IN_RSSI_THRESHOLD);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND_IN_AUTHMODE_THRESHOLD);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY) {
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_NO_AP_FOUND_W_COMPATIBLE_SECURITY);
            } else if ((wifi_sta_disconn_reason == WIFI_REASON_AUTH_FAIL) || (wifi_sta_disconn_reason == WIFI_REASON_CONNECTION_FAIL)) {
                // wrong password
                return MP_OBJ_NEW_SMALL_INT(WIFI_REASON_AUTH_FAIL);
            } else if (wifi_sta_disconn_reason == WIFI_REASON_ASSOC_LEAVE) {
                // After wlan.disconnect()
                return MP_OBJ_NEW_SMALL_INT(STAT_IDLE);
            } else if (wifi_sta_connect_requested
                       && (conf_wifi_sta_reconnects == 0
                           || wifi_sta_reconnects < conf_wifi_sta_reconnects)) {
                // No connection or error, but is requested = Still connecting
                return MP_OBJ_NEW_SMALL_INT(STAT_CONNECTING);
            } else if (wifi_sta_disconn_reason == 0) {
                // No activity, No error = Idle
                return MP_OBJ_NEW_SMALL_INT(STAT_IDLE);
            } else {
                // Simply pass the error through from ESP-identifier
                return MP_OBJ_NEW_SMALL_INT(wifi_sta_disconn_reason);
            }
        }
        return mp_const_none;
    }

    // one argument: return status based on query parameter
    switch ((uintptr_t)args[1]) {
        case (uintptr_t)MP_OBJ_NEW_QSTR(MP_QSTR_stations): {
            // return list of connected stations, only if in soft-AP mode
            require_if(args[0], ESP_IF_WIFI_AP);
            wifi_sta_list_t station_list;
            esp_exceptions(esp_wifi_ap_get_sta_list(&station_list));
            wifi_sta_info_t *stations = (wifi_sta_info_t *)station_list.sta;
            mp_obj_t list = mp_obj_new_list(0, NULL);
            for (int i = 0; i < station_list.num; ++i) {
                mp_obj_tuple_t *t = mp_obj_new_tuple(1, NULL);
                t->items[0] = mp_obj_new_bytes(stations[i].mac, sizeof(stations[i].mac));
                mp_obj_list_append(list, t);
            }
            return list;
        }
        case (uintptr_t)MP_OBJ_NEW_QSTR(MP_QSTR_rssi): {
            // return signal of AP, only in STA mode
            require_if(args[0], ESP_IF_WIFI_STA);

            wifi_ap_record_t info;
            esp_exceptions(esp_wifi_sta_get_ap_info(&info));
            return MP_OBJ_NEW_SMALL_INT(info.rssi);
        }
        default:
            mp_raise_ValueError(MP_ERROR_TEXT("unknown status param"));
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_wlan_status_obj, 1, 2, network_wlan_status);

